logs/01_18/new/19_12/benchmark_fillseq.wal_enabled.v400.log
./db_bench --benchmarks=fillseq        --use_existing_db=0          --db=../data_new_0118_19_12   --wal_dir=../data_new_0118_19_12     --num=80000000   --num_levels=6   --key_size=20   --value_size=400   --block_size=8192   --cache_size=4294967296   --cache_numshardbits=6   --compression_max_dict_bytes=0   --compression_ratio=0.5   --compression_type=zstd   --level_compaction_dynamic_level_bytes=0   --bytes_per_sync=8388608   --cache_index_and_filter_blocks=0   --pin_l0_filter_and_index_blocks_in_cache=1     --write_buffer_size=134217728   --target_file_size_base=134217728   --max_bytes_for_level_base=536870912   --max_bytes_for_level_multiplier=8     --statistics=0   --stats_per_interval=1   --stats_interval_seconds=60   --histogram=1     --open_files=-1     --max_background_jobs=16   --subcompactions=5   --rate_limiter_bytes_per_sec=419430400   --rate_limiter_auto_tuned=1   --max_compaction_bytes=10737418240           --level0_file_num_compaction_trigger=4            --level0_stop_writes_trigger=20           --max_write_buffer_number=2        --min_level_to_compress=0        --threads=1        --disable_wal=0        --seed=1610968349        2>&1 | grep -v "... thread" | tee -a ../logs_new_0118_19_12/benchmark_fillseq.wal_enabled.v400.log
RocksDB:    version 6.4
Date:       Mon Jan 18 19:12:30 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   152.06 MB   0.8      0.0     0.0      0.0       1.6      1.6       0.0   1.0      0.0     18.7     86.68             32.83        32    2.709       0      0
  L1     10/0   506.79 MB   1.0      0.0     0.0      0.0       0.0      0.0       1.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     19/0   962.89 MB   0.2      0.0     0.0      0.0       0.0      0.0       0.9   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     32/0    1.58 GB   0.0      0.0     0.0      0.0       1.6      1.6       2.4   1.0      0.0     18.7     86.68             32.83        32    2.709       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       1.6      1.6       2.4   1.0      0.0     18.7     86.68             32.83        32    2.709       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       1.6      1.6       0.0   0.0      0.0     18.7     86.68             32.83        32    2.709       0      0
Uptime(secs): 60.0 total, 60.0 interval
Flush(GB): cumulative 1.584, interval 1.584
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 1.58 GB write, 27.02 MB/s write, 0.00 GB read, 0.00 MB/s read, 86.7 seconds
Interval compaction: 1.58 GB write, 27.03 MB/s write, 0.00 GB read, 0.00 MB/s read, 86.7 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 17 memtable_compaction, 0 memtable_slowdown, interval 17 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 60.0 total, 60.0 interval
Cumulative writes: 9601K writes, 9601K keys, 9601K commit groups, 1.0 writes per commit group, ingest: 3.90 GB, 66.52 MB/s
Cumulative WAL: 9601K writes, 0 syncs, 9601000.00 writes per sync, written: 3.90 GB, 66.52 MB/s
Cumulative stall: 00:00:32.305 H:M:S, 53.8 percent
Interval writes: 9601K writes, 9601K keys, 9601K commit groups, 1.0 writes per commit group, ingest: 3992.12 MB, 66.53 MB/s
Interval WAL: 9601K writes, 0 syncs, 9601000.00 writes per sync, written: 3.90 MB, 66.53 MB/s
Interval stall: 00:00:32.305 H:M:S, 53.8 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   152.06 MB   0.8      0.0     0.0      0.0       3.3      3.3       0.0   1.0      0.0     18.7    178.78             65.31        66    2.709       0      0
  L1     11/1   558.79 MB   1.0      0.0     0.0      0.0       0.0      0.0       3.1   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     52/0    2.57 GB   0.6      0.0     0.0      0.0       0.0      0.0       2.6   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     66/1    3.27 GB   0.0      0.0     0.0      0.0       3.3      3.3       5.7   1.0      0.0     18.7    178.78             65.31        66    2.709       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       1.7      1.7       3.3   1.0      0.0     18.7     92.10             32.48        34    2.709       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       3.3      3.3       0.0   0.0      0.0     18.7    178.78             65.31        66    2.709       0      0
Uptime(secs): 120.8 total, 60.8 interval
Flush(GB): cumulative 3.269, interval 1.685
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 3.27 GB write, 27.72 MB/s write, 0.00 GB read, 0.00 MB/s read, 178.8 seconds
Interval compaction: 1.69 GB write, 28.40 MB/s write, 0.00 GB read, 0.00 MB/s read, 92.1 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 47 memtable_compaction, 0 memtable_slowdown, interval 30 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 120.8 total, 60.8 interval
Cumulative writes: 19M writes, 19M keys, 19M commit groups, 1.0 writes per commit group, ingest: 7.88 GB, 66.79 MB/s
Cumulative WAL: 19M writes, 0 syncs, 19400000.00 writes per sync, written: 7.88 GB, 66.79 MB/s
Cumulative stall: 00:01:4.540 H:M:S, 53.4 percent
Interval writes: 9799K writes, 9799K keys, 9799K commit groups, 1.0 writes per commit group, ingest: 4074.44 MB, 67.06 MB/s
Interval WAL: 9799K writes, 0 syncs, 9799000.00 writes per sync, written: 3.98 MB, 67.06 MB/s
Interval stall: 00:00:32.235 H:M:S, 53.1 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   152.06 MB   0.8      0.0     0.0      0.0       5.5      5.5       0.0   1.0      0.0     21.7    259.93            100.68       111    2.342       0      0
  L1     10/0   508.74 MB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     80/0    3.96 GB   1.0      0.0     0.0      0.0       0.0      0.0       4.9   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     18/0   914.26 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.9   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    111/0    5.50 GB   0.0      0.0     0.0      0.0       5.5      5.5      11.1   1.0      0.0     21.7    259.93            100.68       111    2.342       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.2      2.2       5.4   1.0      0.0     28.2     81.15             35.37        45    1.803       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       5.5      5.5       0.0   0.0      0.0     21.7    259.93            100.68       111    2.342       0      0
Uptime(secs): 180.8 total, 60.0 interval
Flush(GB): cumulative 5.502, interval 2.233
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 5.50 GB write, 31.16 MB/s write, 0.00 GB read, 0.00 MB/s read, 259.9 seconds
Interval compaction: 2.23 GB write, 38.11 MB/s write, 0.00 GB read, 0.00 MB/s read, 81.1 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 80 memtable_compaction, 0 memtable_slowdown, interval 33 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 180.8 total, 60.0 interval
Cumulative writes: 32M writes, 32M keys, 32M commit groups, 1.0 writes per commit group, ingest: 13.26 GB, 75.13 MB/s
Cumulative WAL: 32M writes, 0 syncs, 32663000.00 writes per sync, written: 13.26 GB, 75.13 MB/s
Cumulative stall: 00:01:26.625 H:M:S, 47.9 percent
Interval writes: 13M writes, 13M keys, 13M commit groups, 1.0 writes per commit group, ingest: 5514.78 MB, 91.91 MB/s
Interval WAL: 13M writes, 0 syncs, 13263000.00 writes per sync, written: 5.39 MB, 91.91 MB/s
Interval stall: 00:00:22.085 H:M:S, 36.8 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   152.06 MB   0.8      0.0     0.0      0.0       8.5      8.5       0.0   1.0      0.0     26.6    328.75            139.08       172    1.911       0      0
  L1     10/0   508.93 MB   1.0      0.0     0.0      0.0       0.0      0.0       8.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     80/0    3.96 GB   1.0      0.0     0.0      0.0       0.0      0.0       7.9   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     79/0    3.92 GB   0.1      0.0     0.0      0.0       0.0      0.0       3.9   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    172/0    8.53 GB   0.0      0.0     0.0      0.0       8.5      8.5      20.2   1.0      0.0     26.6    328.75            139.08       172    1.911       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       3.0      3.0       9.1   1.0      0.0     45.0     68.82             38.40        61    1.128       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       8.5      8.5       0.0   0.0      0.0     26.6    328.75            139.08       172    1.911       0      0
Uptime(secs): 240.8 total, 60.0 interval
Flush(GB): cumulative 8.529, interval 3.027
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 8.53 GB write, 36.27 MB/s write, 0.00 GB read, 0.00 MB/s read, 328.8 seconds
Interval compaction: 3.03 GB write, 51.67 MB/s write, 0.00 GB read, 0.00 MB/s read, 68.8 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 138 memtable_compaction, 0 memtable_slowdown, interval 58 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 240.8 total, 60.0 interval
Cumulative writes: 50M writes, 50M keys, 50M commit groups, 1.0 writes per commit group, ingest: 20.43 GB, 86.88 MB/s
Cumulative WAL: 50M writes, 0 syncs, 50312000.00 writes per sync, written: 20.43 GB, 86.88 MB/s
Cumulative stall: 00:01:36.322 H:M:S, 40.0 percent
Interval writes: 17M writes, 17M keys, 17M commit groups, 1.0 writes per commit group, ingest: 7338.49 MB, 122.30 MB/s
Interval WAL: 17M writes, 0 syncs, 17649000.00 writes per sync, written: 7.17 MB, 122.30 MB/s
Interval stall: 00:00:9.697 H:M:S, 16.2 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   152.06 MB   0.8      0.0     0.0      0.0      12.2     12.2       0.0   1.0      0.0     32.1    387.92            182.78       245    1.583       0      0
  L1     10/0   507.93 MB   1.0      0.0     0.0      0.0       0.0      0.0      12.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L2     80/0    3.96 GB   1.0      0.0     0.0      0.0       0.0      0.0      11.5   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3    152/0    7.54 GB   0.2      0.0     0.0      0.0       0.0      0.0       7.5   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    245/0   12.15 GB   0.0      0.0     0.0      0.0      12.2     12.2      31.1   1.0      0.0     32.1    387.92            182.78       245    1.583       0      0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       3.6      3.6      10.9   1.0      0.0     62.7     59.16             43.71        73    0.810       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      12.2     12.2       0.0   0.0      0.0     32.1    387.92            182.78       245    1.583       0      0
Uptime(secs): 300.8 total, 60.0 interval
Flush(GB): cumulative 12.151, interval 3.622
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 12.15 GB write, 41.37 MB/s write, 0.00 GB read, 0.00 MB/s read, 387.9 seconds
Interval compaction: 3.62 GB write, 61.81 MB/s write, 0.00 GB read, 0.00 MB/s read, 59.2 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 159 memtable_compaction, 0 memtable_slowdown, interval 21 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 300.8 total, 60.0 interval
Cumulative writes: 71M writes, 71M keys, 71M commit groups, 1.0 writes per commit group, ingest: 28.94 GB, 98.51 MB/s
Cumulative WAL: 71M writes, 0 syncs, 71260000.00 writes per sync, written: 28.94 GB, 98.51 MB/s
Cumulative stall: 00:01:36.719 H:M:S, 32.2 percent
Interval writes: 20M writes, 20M keys, 20M commit groups, 1.0 writes per commit group, ingest: 8710.22 MB, 145.16 MB/s
Interval WAL: 20M writes, 0 syncs, 20948000.00 writes per sync, written: 8.51 MB, 145.16 MB/s
Interval stall: 00:00:0.397 H:M:S, 0.7 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    80000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    32043.5 MB (estimated)
FileSize:   16784.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [../data_new_0118_19_12]
fillseq      :       4.082 micros/op 245006 ops/sec;   98.1 MB/s
Microseconds per write:
Count: 80000000 Average: 4.0815  StdDev: 31.82
Min: 2  Median: 2.3170  Max: 3394657
Percentiles: P50: 2.32 P75: 2.78 P99: 5.58 P99.9: 12.70 P99.99: 25.49
------------------------------------------------------
(       1,       2 ] 26402410  33.003%  33.003% #######
(       2,       3 ] 42890699  53.613%  86.616% ###########
(       3,       4 ]  8223297  10.279%  96.896% ##
(       4,       6 ]  2137209   2.672%  99.567% #
(       6,      10 ]   251093   0.314%  99.881% 
(      10,      15 ]    28288   0.035%  99.916% 
(      15,      22 ]    56420   0.071%  99.987% 
(      22,      34 ]     8888   0.011%  99.998% 
(      34,      51 ]      732   0.001%  99.999% 
(      51,      76 ]      374   0.000%  99.999% 
(      76,     110 ]      194   0.000% 100.000% 
(     110,     170 ]      134   0.000% 100.000% 
(     170,     250 ]       80   0.000% 100.000% 
(     250,     380 ]        8   0.000% 100.000% 
(     580,     870 ]        2   0.000% 100.000% 
(     870,    1300 ]        2   0.000% 100.000% 
(    1900,    2900 ]        1   0.000% 100.000% 
(    4400,    6600 ]        2   0.000% 100.000% 
(    6600,    9900 ]        7   0.000% 100.000% 
(    9900,   14000 ]        9   0.000% 100.000% 
(   14000,   22000 ]       11   0.000% 100.000% 
(   22000,   33000 ]        8   0.000% 100.000% 
(   33000,   50000 ]        9   0.000% 100.000% 
(   50000,   75000 ]       17   0.000% 100.000% 
(   75000,  110000 ]        9   0.000% 100.000% 
(  110000,  170000 ]        6   0.000% 100.000% 
(  170000,  250000 ]        7   0.000% 100.000% 
(  250000,  380000 ]       13   0.000% 100.000% 
(  380000,  570000 ]       13   0.000% 100.000% 
(  570000,  860000 ]       15   0.000% 100.000% 
(  860000, 1200000 ]       15   0.000% 100.000% 
( 1200000, 1900000 ]       14   0.000% 100.000% 
( 1900000, 2900000 ]        9   0.000% 100.000% 
( 2900000, 4300000 ]        5   0.000% 100.000%